Public Member Functions | Friends | List of all members
ACAPI::MEP::FlexibleSegmentDefault Class Referencefinal
MEP Element Manager
The FlexibleSegmentDefault contains the necessary non-geometric data for creating a FlexibleSegment element. More...
#include <MEPFlexibleSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::FlexibleSegmentDefault:
 Public Member Functions
Result< UniqueID >  | Place (const std::vector< API_Coord3D > &controlPoints, const Orientation &startOrientation, const Orientation &endOrientation, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places a FlexibleSegment element defined by a spline geometry based on this Default.
Result< UniqueID >  | PlacePolyline (const FlexibleSegmentPolyline &polyline, const std::optional< API_Vector3D > &startDirectionVector, const std::optional< API_Vector3D > &endDirectionVector, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places a FlexibleSegment element defined by a polyline based on this Default. Only supported domain is Piping.
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
 Public Member Functions inherited from ACAPI::MEP::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
Result< Domain >  | GetDomainOfPort (uint32_t portIndex) const
Result< VentilationPortDefault >  | GetVentilationPortDefault (uint32_t portIndex) const
Result< PipingPortDefault >  | GetPipingPortDefault (uint32_t portIndex) const
Result< CableCarrierPortDefault >  | GetCableCarrierPortDefault (uint32_t portIndex) const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 Public Member Functions inherited from ACAPI::ElementDefault
ElementDefault (std::shared_ptr< Impl::ElementDefaultImpl > impl)
Constructs a new ElementDefault.
Result< void >  | SetAsArchicadDefault () const
Sets the locally prepared Default settings to the Archicad Default.
API_ElemType  | GetElemType () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
 class  | ACAPI::Impl::ObjectCreator
Result< FlexibleSegmentDefault >  | CreateFlexibleSegmentDefault (Domain domain)
Creates a FlexibleSegmentDefault.
MEPAPI_EXPORT Result< FlexibleSegmentDefault >  | CreateFlexibleSegmentDefault (const ACAPI::ElementDefault &defaultElem)
Creates a FlexibleSegmentDefault from the given base element default.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Constructs an ElementDefault with the given element default implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The FlexibleSegmentDefault contains the necessary non-geometric data for creating a FlexibleSegment element.
Since
Archicad 27
Example code snippet from Test / New MEP
Pickup and Getters
 // Write Defaults
 FlexibleSegmentDefault flexibleSegmentDefault = flexibleSegment->PickUpDefault ();
 reporter.SetTabCount (0);
 reporter.Add ("Default Flexible Segment:");
 reporter.SetTabCount (1);
 reporter.Add ("Width", flexibleSegmentDefault.GetWidth ());
 reporter.Add ("Height", flexibleSegmentDefault.GetHeight ());
 reporter.Add ("Shape", flexibleSegmentDefault.GetShape ());
 reporter.Add ("Domain", flexibleSegmentDefault.GetDomain ());
 reporter.Write ();
 Placement
 auto ductFlexibleSegmentDefault = CreateFlexibleSegmentDefault (Domain::Ventilation);
 if (ductFlexibleSegmentDefault.IsErr ())
 return ductFlexibleSegmentDefault.UnwrapErr ().kind;
 std::vector<API_Coord3D> controlPoints = {
 { 0.0, 30.0, 0.0 },
 { 2.0, 31.0, 0.0 },
 { 4.0, 29.0, 0.0 },
 { 6.0, 30.0, 0.0 }
 };
 ACAPI::Result<UniqueID> flexibleSegment = ductFlexibleSegmentDefault->Place (controlPoints, { { -1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, GenerateAPIGuid ());
 if (flexibleSegment.IsErr ())
 return flexibleSegment.UnwrapErr ().kind;
 ACAPI_WriteReport ("Ventilation FlexibleSegment placed successfully", false);
 }
 {
 auto pipeFlexibleSegmentDefault = CreateFlexibleSegmentDefault (Domain::Piping);
 if (pipeFlexibleSegmentDefault.IsErr ())
 return pipeFlexibleSegmentDefault.UnwrapErr ().kind;
 std::vector<API_Coord3D> controlPoints = {
 { 20.0, 30.0, 0.0 },
 { 22.0, 31.0, 0.0 },
 { 24.0, 29.0, 0.0 },
 { 26.0, 30.0, 0.0 }
 };
 ACAPI::Result<UniqueID> flexibleSegment = pipeFlexibleSegmentDefault->Place (controlPoints, { { -1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } }, GenerateAPIGuid ());
 if (flexibleSegment.IsErr ())
 return flexibleSegment.UnwrapErr ().kind;
 ACAPI_WriteReport ("Piping FlexibleSegment placed successfully", false);
 }
 Polyline Placement
 auto flexiblePipe = CreateFlexibleSegmentDefault (Domain::Piping);
 if (flexiblePipe.IsErr ())
 return flexiblePipe.UnwrapErr ().kind;
 ACAPI::MEP::FlexibleSegmentPolyline polyline;
 double offsetY = 20;
 for (UIndex i = 0; i < 5; ++i) {
 polyline.push_back (ACAPI::MEP::FlexibleSegmentPolylineLinePart {
 { i * 4.0 + 0.0, offsetY + 0.0, 0.0 },
 { i * 4.0 + 0.0, offsetY + 10.0, 0.0 },
 });
 polyline.push_back (ACAPI::MEP::FlexibleSegmentPolylineSplinePart { std::vector<API_Coord3D> {
 { i * 4.0 + 0.0, offsetY + 10.0, 0.0 },
 { i * 4.0 + 1.0, offsetY + 11.0, 0.0 },
 { i * 4.0 + 2.0, offsetY + 10.0, 0.0 }
 } });
 polyline.push_back (ACAPI::MEP::FlexibleSegmentPolylineLinePart {
 { i * 4.0 + 2.0, offsetY + 10.0, 0.0 },
 { i * 4.0 + 2.0, offsetY + 0.0, 0.0 },
 });
 polyline.push_back (ACAPI::MEP::FlexibleSegmentPolylineSplinePart { std::vector<API_Coord3D> {
 { i * 4.0 + 2.0, offsetY + 0.0, 0.0 },
 { i * 4.0 + 3.0, offsetY + -1.0, 0.0 },
 { i * 4.0 + 4.0, offsetY + 0.0, 0.0 }
 } });
 }
 ACAPI::Result<UniqueID> flexibleSegment = flexiblePipe->PlacePolyline (polyline, std::nullopt, API_Vector3D { 1.0, 0.0, 0.0 }, GenerateAPIGuid ());
 if (flexibleSegment.IsErr ())
 return flexibleSegment.UnwrapErr ().kind;
Member Function Documentation
◆ GetHeight()
 double ACAPI::MEP::FlexibleSegmentDefault::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the FlexibleSegment.
◆ GetShape()
 ConnectorShape ACAPI::MEP::FlexibleSegmentDefault::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the FlexibleSegment.
◆ GetWidth()
 double ACAPI::MEP::FlexibleSegmentDefault::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the FlexibleSegment.
◆ Place()
 Result< UniqueID > ACAPI::MEP::FlexibleSegmentDefault::Place  |  ( |  const std::vector< API_Coord3D > & |  controlPoints,
|  const Orientation & |  startOrientation,
|  const Orientation & |  endOrientation,
|  const std::optional< API_Guid > & |  requiredId = std::nullopt ) const
Places a FlexibleSegment element defined by a spline geometry based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several RoutingElements and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created RoutingElement and/or MEP element, therefore the performance should be improved.
Parameters
controlPoints | The control points the FlexibleSegment will be placed with.
startOrientation | The orientation of the start point of the FlexibleSegment, which is based on a direction vector and a rotation vector.
endOrientation | The orientation of the end point of the FlexibleSegment, which is based on a direction vector and a rotation vector.
requiredId | The guid to be set for the FlexibleSegment - optional parameter.
Returns
If executed with success, returns the newly placed FlexibleSegment's uniqueId, otherwise Error.
◆ PlacePolyline()
 Result< UniqueID > ACAPI::MEP::FlexibleSegmentDefault::PlacePolyline  |  ( |  const FlexibleSegmentPolyline & |  polyline,
|  const std::optional< API_Vector3D > & |  startDirectionVector,
|  const std::optional< API_Vector3D > & |  endDirectionVector,
|  const std::optional< API_Guid > & |  requiredId = std::nullopt ) const
Places a FlexibleSegment element defined by a polyline based on this Default. Only supported domain is Piping.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several RoutingElements and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created RoutingElement and/or MEP element, therefore the performance should be improved.
Parameters
polyline | The polyline geometry the FlexibleSegment will be placed with. The polyline must include alternating types of segments, either a straight line (defined by its begin and end coordinates), or a spline (defined by its control points). Adjacent segments must connect at their starting/ending points.
startDirectionVector | The direction vector of the start point of the FlexibleSegment. Must be nullopt when the first segment is a line.
endDirectionVector | The direction vector of the end point of the FlexibleSegment. Must be nullopt when the last segment is a line.
requiredId | The guid to be set for the FlexibleSegment - optional parameter.
Returns
If executed with success, returns the newly placed FlexibleSegment's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateFlexibleSegmentDefault [1/2]
 MEPAPI_EXPORT Result< FlexibleSegmentDefault > CreateFlexibleSegmentDefault  |  ( |  const ACAPI::ElementDefault & |  defaultElem | )
friend
Creates a FlexibleSegmentDefault from the given base element default.
Parameters
defaultElem | The base element default which will be converted to a FlexibleSegmentDefault.
Since
Archicad 29
Returns
If the given base element default refers to a FlexibleSegment, returns a copy of the FlexibleSegmentDefault, otherwise Error.
◆ CreateFlexibleSegmentDefault [2/2]
 Result< FlexibleSegmentDefault > CreateFlexibleSegmentDefault  |  ( |  Domain |  domain | )
friend
Creates a FlexibleSegmentDefault.
Parameters
domain | The domain determines whether the Default will be Duct or Pipe FlexibleSegment tool.
Returns
If able, returns a copy of Archicad's current Default of the Duct (Ventilation) or Pipe (Piping) FlexibleSegment tool, otherwise Error.